
#+begin_src jupyter-python
import proplot as plt, cmasher as cmr, pandas as pd,\
    numpy as np, os, sys, networkx as nx, warnings
from plexsim import models
from imi import infcy

a = np.eye(2)
b = np.zeros((2, 2, 2))
b[0, 0] = 1

c = np.einsum("ij, jkl -> il", a, b)
print(a @ b, (a @ b).shape)
print(c, c.shape)
#+end_src

#+RESULTS:
: [[[1. 1.]
:   [0. 0.]]
:
:  [[0. 0.]
:   [0. 0.]]] (2, 2, 2)
: [[1. 1.]
:  [0. 0.]] (2, 2)
